IRP/src/Catalogs/Companies/Companies.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Companies</name>
  <attributes>
    <name>Country</name>
    <type>
      <types>CatalogRef.Countries</types>
    </type>
  </attributes>
  <attributes>
    <name>MainCompany</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>Type</name>
    <type>
      <types>CatalogRef.CompanyTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>Our</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Currencies</name>
    <attributes>
      <name>MovementType</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/CatPartnersServer/Module.bsl
Procedure OnCreateAtServer(Cancel, StandardProcessing, Form, Parameters) Export
	FillingData = Undefined;
	If Parameters.Property("FillingData", FillingData) Then
		Form.FillingData = CommonFunctionsServer.SerializeXMLUseXDTO(FillingData);
	EndIf;
	If Form.FormName = "Catalog.Partners.Form.ChoiceForm" Then
		Form.List.Parameters.SetParameterValue("FilterPartnersByCompanies", Parameters.FilterPartnersByCompanies);
		Form.List.Parameters.SetParameterValue("PartnersByCompanies", New Array());
		If Parameters.FilterPartnersByCompanies Then
			CompaniesArray = New Array();
			CompaniesArray.Add(Parameters.Company);
			PartnersArray = CatPartnersServer.GetPartnersByCompanies(CompaniesArray);
			Form.List.Parameters.SetParameterValue("PartnersByCompanies", PartnersArray);
		EndIf;
	EndIf;
EndProcedure

Function GetPartnersByCompanies(CompaniesArray) Export
	
	ReturnValue = New Array;
	
	Query = New Query;
	Query.Text = "SELECT
		|	Company.Partner
		|FROM
		|	Catalog.Companies AS Company
		|WHERE
		|	Company.Ref IN (&CompaniesArray)
		|GROUP BY
		|	Company.Partner";
	Query.SetParameter("CompaniesArray", CompaniesArray);
	QueryExecute = Query.Execute();
	If Not QueryExecute.IsEmpty() Then
		QueryUnload = QueryExecute.Unload();
		ReturnValue = QueryUnload.UnloadColumn("Partner");
	EndIf;
	
	Return ReturnValue;
	
EndFunction
